app/Views/frontend/home.php

SELECT *
FROM `news`
WHERE `category_id` = '1'
AND `status` = 1
ORDER BY `published_at` DESC
 LIMIT 4
---

            $cat_id = $category['id'];
            $db = \Config\Database::connect();
            $cat_news = $db->table('news')
                           ->where('category_id', $cat_id)
                           ->where('status', 1)
                           ->orderBy('published_at', 'DESC')
                           ->limit(4)
                           ->get()
                           ->getResultArray();