app/Views/frontend/single_news.php

SELECT *
FROM `news`
WHERE `category_id` = '1'
AND `id` != '2059'
AND `status` = 1
ORDER BY `published_at` DESC
 LIMIT 4
---
                <div class="row g-3">
                    <?php
                        $db = \Config\Database::connect();
                        $related = $db->table('news')->where('category_id', $news['category_id'])->where('id !=', $news['id'])->where('status', 1)->orderBy('published_at', 'DESC')->limit(4)->get()->getResultArray();