app/Controllers/Admin/CategoryController.php

SELECT *
FROM `categories`
WHERE `parent_id` = '163'
AND `IsActice` = 1
ORDER BY `name` ASC
---
    public function getChildren($parentId)
    {
        // ఇక్కడ కేవలం లైవ్ వార్తల కోసం కాబట్టి IsActice = 1 ఉంచాలి
        $data = $this->categoryModel
            ->where(['parent_id' => $parentId, 'IsActice' => 1])
            ->orderBy('name', 'ASC')
            ->findAll();