app/Controllers/Admin/News.php

SELECT *
FROM `categories`
WHERE `IsActice` = 1
AND `type` IN ('main','state')
---
    $data = [
        'news_list'       => $builder->orderBy('news.created_at', 'DESC')->paginate(10),
        'pager'           => $newsModel->pager,
        'categories'      => $catModel->where('IsActice', 1)->whereIn('type', ['main', 'state'])
                                  ->findAll(), // ఫిల్టర్ డ్రాప్‌డౌన్ కోసం

SELECT *
FROM `news`
WHERE `news`.`id` = '2060'
SELECT *
FROM `categories`
WHERE `IsActice` = 1
---
    public function edit($id = null)
{
    if (!$id) {
        return redirect()->to('admin/news/manage')->with('error', 'వార్త ఐడి లభించలేదు.');
    }

    $newsModel = new \App\Models\NewsModel();
    $data['news'] = $newsModel->find($id);

    if (!$data['news']) {
        return redirect()->to('admin/news/manage')->with('error', 'వార్త దొరకలేదు.');
    }

    $categoryModel = new \App\Models\CategoryModel();
    // గమనిక: మీ టేబుల్ లో కాలమ్ పేరు 'is_active' అయితే ఇక్కడ అది వాడాలి.
    $data['categories'] = $categoryModel->where('IsActice', 1)->findAll();

SELECT *
FROM `news`
WHERE `news`.`id` = '2060'
---
    public function update($id)
{
    $newsModel = new \App\Models\NewsModel();
    $oldNews = $newsModel->find($id);