app/Controllers/Home.php

    public function index()
    {
        $newsModel = new NewsModel();
        $categoryModel = new CategoryModel();
        $bannerModel = new BannersModel();

        $data['total_views'] = $newsModel->selectSum('view_count')->first()['view_count'] ?? 0;

        // 1. అన్ని యాక్టివ్ మెయిన్ కేటగిరీలను తెచ్చుకోవడం
        $data['categories'] = $categoryModel->groupStart()
                                            ->where('type', 'main')
                                            ->orWhere('type', 'state')
                                        ->groupEnd()
                                        ->where('IsActice', 1)
                                        ->findAll();

        // 2. బ్రేకింగ్ న్యూస్ (Ticker కోసం)
        $data['breaking_news'] = $newsModel->where(['is_breaking_news' => 1, 'status' => 1])
                                           ->orderBy('published_at', 'DESC')
                                           ->limit(10)
                                           ->findAll();

        // 3. తాజా వార్తలు (Latest 15)
        $data['latest_news'] = $newsModel->where('status', 1)
                                         ->orderBy('published_at', 'DESC')
                                         ->findAll(15);

        // 4. ట్రెండింగ్ వార్తలు (Top 7)
        $data['trending_news'] = $newsModel->where('status', 1)
                                           ->orderBy('view_count', 'DESC')
                                           ->findAll(7);

        // 5. ప్రకటనల డేటా (Enhanced Banners Logic)
        // Top Banner: తాజాది ఒకటి
        $data['top_banner']    = $bannerModel->where(['position' => 'top_banner', 'status' => 1])
                                             ->orderBy('id', 'DESC')
                                             ->first();

        // Slide Ads: స్లైడర్ లో వార్తల మధ్య వచ్చేవి (Randomize for variety)
        $data['slide_ads']     = $bannerModel->where(['position' => 'slide_ad', 'status' => 1])
                                             ->orderBy('id', 'RANDOM') // ప్రతిసారి కొత్త అడ్స్ కనిపించడానికి
                                             ->findAll();

        // Sidebar Ads: సైడ్ బార్ లో వరుసగా వచ్చేవి
        $data['sidebar_ads']   = $bannerModel->where(['position' => 'sidebar_ad', 'status' => 1])
                                             ->orderBy('id', 'DESC')
                                             ->findAll();

        // Category Ads: సెక్షన్స్ మధ్యలో వచ్చేవి
        $data['category_ads']  = $bannerModel->where(['position' => 'category_ad', 'status' => 1])
                                             ->orderBy('id', 'DESC')
                                             ->findAll();
---
SELECT SUM(`view_count`) AS `view_count`
FROM `news`
 LIMIT 1
SELECT *
FROM `categories`
WHERE   (
`type` = 'main'
OR `type` = 'state'
 )
AND `IsActice` = 1
SELECT *
FROM `news`
WHERE `is_breaking_news` = 1
AND `status` = 1
ORDER BY `published_at` DESC
 LIMIT 10
SELECT *
FROM `news`
WHERE `status` = 1
ORDER BY `published_at` DESC
 LIMIT 15
SELECT *
FROM `news`
WHERE `status` = 1
ORDER BY `view_count` DESC
 LIMIT 7
SELECT *
FROM `banners`
WHERE `position` = 'top_banner'
AND `status` = 1
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `banners`
WHERE `position` = 'slide_ad'
AND `status` = 1
ORDER BY RAND()
SELECT *
FROM `banners`
WHERE `position` = 'sidebar_ad'
AND `status` = 1
ORDER BY `id` DESC
SELECT *
FROM `banners`
WHERE `position` = 'category_ad'
AND `status` = 1
ORDER BY `id` DESC

        $data['youtube_videos'] = $this->getYouTubeVideos();

        // 7. వివిధ కేటగిరీల వార్తలు (Dynamic)
        $data['politics_news'] = $newsModel->where(['category_id' => 1, 'status' => 1])->orderBy('published_at', 'DESC')->findAll(4);
        $data['cinema_news']   = $newsModel->where(['category_id' => 2, 'status' => 1])->orderBy('published_at', 'DESC')->findAll(4);
        $data['sports_news']   = $newsModel->where(['category_id' => 3, 'status' => 1])->orderBy('published_at', 'DESC')->findAll(4);
---
SELECT *
FROM `news`
WHERE `category_id` = 1
AND `status` = 1
ORDER BY `published_at` DESC
 LIMIT 4
SELECT *
FROM `news`
WHERE `category_id` = 2
AND `status` = 1
ORDER BY `published_at` DESC
 LIMIT 4
SELECT *
FROM `news`
WHERE `category_id` = 3
AND `status` = 1
ORDER BY `published_at` DESC
 LIMIT 4

    public function view($slug)
{
    $newsModel = new NewsModel();
    $bannerModel = new BannersModel();
    $categoryModel = new \App\Models\CategoryModel();

    $news = $newsModel->select('
        news.*,
        categories.name as category_name,
        categories.type as category_type,
        sub_cats.name as sub_category_name,
        districts.name as district_name,
        mandals.name as mandal_name,
        villages.name as village_name,
        users.display_name as reporter_name,
        users.profile_pic as reporter_image,
        users.area_coverage as reporter_area
    ')
    ->join('categories', 'categories.id = news.category_id', 'left')
    ->join('categories as sub_cats', 'sub_cats.id = news.sub_category_id', 'left')
    ->join('categories as districts', 'districts.id = news.district_id', 'left')
    ->join('categories as mandals', 'mandals.id = news.mandal_id', 'left')
    ->join('categories as villages', 'villages.id = news.village_id', 'left')
    ->join('users', 'users.id = news.author_id', 'left')
    ->where('news.slug', $slug)
    ->where('news.status', 1)
    ->first();
---
SELECT `news`.*, `categories`.`name` as `category_name`, `categories`.`type` as `category_type`, `sub_cats`.`name` as `sub_category_name`, `districts`.`name` as `district_name`, `mandals`.`name` as `mandal_name`, `villages`.`name` as `village_name`, `users`.`display_name` as `reporter_name`, `users`.`profile_pic` as `reporter_image`, `users`.`area_coverage` as `reporter_area`
FROM `news`
LEFT JOIN `categories` ON `categories`.`id` = `news`.`category_id`
LEFT JOIN `categories` as `sub_cats` ON `sub_cats`.`id` = `news`.`sub_category_id`
LEFT JOIN `categories` as `districts` ON `districts`.`id` = `news`.`district_id`
LEFT JOIN `categories` as `mandals` ON `mandals`.`id` = `news`.`mandal_id`
LEFT JOIN `categories` as `villages` ON `villages`.`id` = `news`.`village_id`
LEFT JOIN `users` ON `users`.`id` = `news`.`author_id`
WHERE `news`.`slug` = 'death-that-wont-leave-even-after-the-debt-is-paid-7614'
AND `news`.`status` = 1
 LIMIT 1


    // ఈ వార్త ఐడి సెషన్‌లో లేకపోతేనే అప్‌డేట్ చేయండి
    if (!in_array($news['id'], $viewed_news)) {
        $newsModel->where('id', $news['id'])
                  ->set('view_count', 'view_count + 1', FALSE)
                  ->update();
---
UPDATE `news` SET `view_count` = view_count + 1, `updated_at` = '2026-03-12 09:27:53'
WHERE `id` = '2059'

        'title'          => $news['title'],
        'meta_desc'      => $news['meta_description'],
        'meta_keys'      => $news['meta_keywords'],
        'latest_news'    => $newsModel->where('status', 1)->orderBy('published_at', 'DESC')->findAll(6),
        'trending_news'  => $newsModel->where('status', 1)->orderBy('view_count', 'DESC')->findAll(6),
        'related_news'   => $newsModel->where('category_id', $news['category_id'])->where('id !=', $news['id'])->where('status', 1)->orderBy('published_at', 'DESC')->findAll(4),
        'sidebar_ads'    => $bannerModel->where(['position' => 'sidebar_ad', 'status' => 1])->orderBy('id', 'RANDOM')->findAll(3),
        'main_categories'  => $categoryModel->where(['type' => 'main', 'IsActice' => 1])->findAll(),
        'state_categories' => $categoryModel->where(['type' => 'state', 'IsActice' => 1])->findAll(),
        'total_views'      => $newsModel->selectSum('view_count')->first()['view_count'] ?? 0
---
SELECT *
FROM `news`
WHERE `status` = 1
ORDER BY `published_at` DESC
 LIMIT 6
SELECT *
FROM `news`
WHERE `status` = 1
ORDER BY `view_count` DESC
 LIMIT 6
SELECT *
FROM `news`
WHERE `category_id` = '1'
AND `id` != '2059'
AND `status` = 1
ORDER BY `published_at` DESC
 LIMIT 4
SELECT *
FROM `banners`
WHERE `position` = 'sidebar_ad'
AND `status` = 1
ORDER BY RAND()
 LIMIT 3
SELECT *
FROM `categories`
WHERE `type` = 'main'
AND `IsActice` = 1
SELECT *
FROM `categories`
WHERE `type` = 'state'
AND `IsActice` = 1
SELECT SUM(`view_count`) AS `view_count`
FROM `news`
 LIMIT 1