app/Controllers/ReporterController.php

    public function index()
    {
        $newsModel = new NewsModel();
        $userId = session()->get('user_id');

        if (!$userId) return redirect()->to('login');

        $data = [
            'my_news' => $newsModel->where('author_id', $userId)
                                   ->orderBy('created_at', 'DESC')
                                   ->findAll(),
            'published_count' => $newsModel->where(['author_id' => $userId, 'status' => 1])->countAllResults(),
            'pending_count'   => $newsModel->where(['author_id' => $userId, 'status' => 0])->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `news`
WHERE `author_id` = '4'
AND `status` = 1
SELECT COUNT(*) AS `numrows`
FROM `news`
WHERE `author_id` = '4'
AND `status` = 0